IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_usb_regs.xml
<module id="USB_REGS" HW_revision="" description="USB Registers">
	<register id="USBFADDR" width="8" page="1" offset="0x0" internal="0" description="USB Device Functional Address">
		<bitfield id="FUNCADDR" description="Functional Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBPOWER" width="8" page="1" offset="0x1" internal="0" description="USB Power">
		<bitfield id="PWRDNPHY" description="Power Down PHY" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SUSPEND" description="Enable Suspend" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RESUME" description="Enable Resume Signaling" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RESET" description="Enable Reset Signaling" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SOFT_CONN" description="Soft Connect/Disconnect" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ISOUP" description="Isochronous Update" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBTXIS" width="16" page="1" offset="0x2" internal="0" description="USB Transmit Interrupt Status">
		<bitfield id="EP0" description="Transmit Endpoint 0 Interrupt" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EP1" description="Transmit Endpoint 1 Interrupt" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EP2" description="Transmit Endpoint 2 Interrupt" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EP3" description="Transmit Endpoint 3 Interrupt" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="USBRXIS" width="16" page="1" offset="0x4" internal="0" description="USB Receive Interrupt Status">
		<bitfield id="EP1" description="Recieve Endpoint 1 Interrupt" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EP2" description="Recieve Endpoint 2 Interrupt" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EP3" description="Recieve Endpoint 3 Interrupt" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="USBTXIE" width="16" page="1" offset="0x6" internal="0" description="USB Transmit Interrupt Enable">
		<bitfield id="EP0" description="Transmit Endpoint 0 Interrupt Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EP1" description="Transmit Endpoint 1 Interrupt Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EP2" description="Transmit Endpoint 2 Interrupt Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EP3" description="Transmit Endpoint 3 Interrupt Enable" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="USBRXIE" width="16" page="1" offset="0x8" internal="0" description="USB Receive Interrupt Enable">
		<bitfield id="EP1" description="Recieve Endpoint 1 Interrupt Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EP2" description="Recieve Endpoint 2 Interrupt Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EP3" description="Recieve Endpoint 3 Interrupt Enable" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="USBIS" width="8" page="1" offset="0xa" internal="0" description="USB General Interrupt Status">
		<bitfield id="SUSPEND" description="SUSPEND Signaling Detected" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="RESUME" description="RESUME Signaling Detected." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RESET" description="RESET Signaling Detected" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SOF" description="Start of frame" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DISCON" description="Session Disconnect" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="USBIE" width="8" page="1" offset="0xb" internal="0" description="USB Interrupt Enable">
		<bitfield id="SUSPEND" description="SUSPEND Signaling Detected" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="RESUME" description="RESUME Signaling Detected." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RESET" description="RESET Signaling Detected" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SOF" description="Start of frame" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DISCON" description="Session Disconnect" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="USBFRAME" width="16" page="1" offset="0xc" internal="0" description="USB Frame Value">
		<bitfield id="FRAME" description="Frame Number" begin="10" end="0" width="11" rwaccess="R"/>
	</register>
	<register id="USBEPIDX" width="8" page="1" offset="0xe" internal="0" description="USB Endpoint Index">
		<bitfield id="EPIDX" description="Endpoint Index" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="USBTEST" width="8" page="1" offset="0xf" internal="0" description="USB Test Mode">
		<bitfield id="FORCEFS" description="Force Full Speed Upon Reset" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="FIFOACC" description="FIFO Access" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="FORCEH" description="Force Host Mode" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBFIFO0" width="32" page="1" offset="0x20" internal="0" description="USB FIFO Endpoint 0">
		<bitfield id="EPDATA" description="Endpoint Data." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USBFIFO1" width="32" page="1" offset="0x24" internal="0" description="USB FIFO Endpoint 1">
		<bitfield id="EPDATA" description="Endpoint Data." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USBFIFO2" width="32" page="1" offset="0x28" internal="0" description="USB FIFO Endpoint 2">
		<bitfield id="EPDATA" description="Endpoint Data." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USBFIFO3" width="32" page="1" offset="0x2c" internal="0" description="USB FIFO Endpoint 3">
		<bitfield id="EPDATA" description="Endpoint Data." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USBDEVCTL" width="16" page="1" offset="0x60" internal="0" description="USB Device Control">
		<bitfield id="SESSION" description="Session Start/End" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="HOSTREQ" description="Host Request" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="HOST" description="Host Mode" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="VBUS" description="Vbus Level" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="LSDEV" description="Low Speed Device Detected" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="FSDEV" description="Full Speed Device Detected" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DEV" description="Device Mode" begin="7" end="7" width="1" rwaccess="R"/>
	</register>
	<register id="USBTXFIFOSZ" width="8" page="1" offset="0x62" internal="0" description="USB Transmit Dynamic FIFO Sizing">
		<bitfield id="SIZE" description="Max Packet Size" begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="DPB" description="Double Packet Buffer Support" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
