IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_usb_regs.xml
	<register id="USBRXFIFOSZ" width="8" page="1" offset="0x63" internal="0" description="USB Receive Dynamic FIFO Sizing">
		<bitfield id="SIZE" description="Max Packet Size" begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="DPB" description="Double Packet Buffer Support" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="USBTXFIFOADD" width="16" page="1" offset="0x64" internal="0" description="USB Transmit FIFO Start Address">
		<bitfield id="ADDR" description="Endpoint Data" begin="8" end="0" width="9" rwaccess="RW"/>
	</register>
	<register id="USBRXFIFOADD" width="16" page="1" offset="0x66" internal="0" description="USB Receive FIFO Start Address">
		<bitfield id="ADDR" description="Endpoint Data" begin="8" end="0" width="9" rwaccess="RW"/>
	</register>
	<register id="USBCONTIM" width="8" page="1" offset="0x7a" internal="0" description="USB Connect Timing">
		<bitfield id="WTID" description="Wait ID" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="WTCON" description="Connect Wait" begin="7" end="4" width="4" rwaccess="RW"/>
	</register>
	<register id="USBFSEOF" width="8" page="1" offset="0x7d" internal="0" description="USB Full-Speed Last Transaction to End of Frame Timing">
		<bitfield id="FSEOFG" description="The full-speed end-of-frame gap field" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="USBLSEOF" width="8" page="1" offset="0x7e" internal="0" description="USB Low-Speed Last Transaction to End of Frame Timing">
		<bitfield id="LSEOFG" description="The low-speed end-of-frame gap field" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="USBTXFUNCADDR0" width="8" page="1" offset="0x80" internal="0" description="USB Transmit Functional Address Endpoint 0">
		<bitfield id="ADDR" description="Device Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXHUBADDR0" width="8" page="1" offset="0x82" internal="0" description="USB Transmit Hub Address Endpoint 0">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXHUBPORT0" width="8" page="1" offset="0x83" internal="0" description="USB Transmit Hub Port Endpoint 0">
		<bitfield id="ADDR" description="Hub Port" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXFUNCADDR1" width="8" page="1" offset="0x88" internal="0" description="USB Transmit Functional Address Endpoint 1">
		<bitfield id="ADDR" description="Device Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXHUBADDR1" width="8" page="1" offset="0x8a" internal="0" description="USB Transmit Hub Address Endpoint 1">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXHUBPORT1" width="8" page="1" offset="0x8b" internal="0" description="USB Transmit Hub Port Endpoint 1">
		<bitfield id="ADDR" description="Hub Port" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBRXFUNCADDR1" width="8" page="1" offset="0x8c" internal="0" description="USB Receive Functional Address Endpoint 1">
		<bitfield id="ADDR" description="Device Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBRXHUBADDR1" width="8" page="1" offset="0x8e" internal="0" description="USB Receive Hub Address Endpoint 1">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="MULTTRAN" description="Hub has Multiple Translators" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBRXHUBPORT1" width="8" page="1" offset="0x8f" internal="0" description="USB Receive Hub Port Endpoint 1">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXFUNCADDR2" width="8" page="1" offset="0x90" internal="0" description="USB Transmit Functional Address Endpoint 2">
		<bitfield id="ADDR" description="Device Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXHUBADDR2" width="8" page="1" offset="0x92" internal="0" description="USB Transmit Hub Address Endpoint 2">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXHUBPORT2" width="8" page="1" offset="0x93" internal="0" description="USB Transmit Hub Port Endpoint 2">
		<bitfield id="ADDR" description="Hub Port" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBRXFUNCADDR2" width="8" page="1" offset="0x94" internal="0" description="USB Receive Functional Address Endpoint 2">
		<bitfield id="ADDR" description="Device Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBRXHUBADDR2" width="8" page="1" offset="0x96" internal="0" description="USB Receive Hub Address Endpoint 2">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="MULTTRAN" description="Hub has Multiple Translators" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBRXHUBPORT2" width="8" page="1" offset="0x97" internal="0" description="USB Receive Hub Port Endpoint 2">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXFUNCADDR3" width="8" page="1" offset="0x98" internal="0" description="USB Transmit Functional Address Endpoint 3">
		<bitfield id="ADDR" description="Device Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXHUBADDR3" width="8" page="1" offset="0x9a" internal="0" description="USB Transmit Hub Address Endpoint 3">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXHUBPORT3" width="8" page="1" offset="0x9b" internal="0" description="USB Transmit Hub Port Endpoint 3">
		<bitfield id="ADDR" description="Hub Port" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
