IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_usb_regs.xml
	<register id="USBTXCSRH3" width="8" page="1" offset="0x133" internal="0" description="USB Transmit Control and Status Endpoint 3 High">
		<bitfield id="DT" description="Data Toggle" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DTWE" description="Data Toggle Write Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMAMOD" description="DMA Request Mode" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FDT" description="Force Data Toggle" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DMAEN" description="DMA Request Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MODE" description="Mode" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ISO" description="Isochronous Transfers" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="AUTOSET" description="Auto Set" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBRXMAXP3" width="16" page="1" offset="0x134" internal="0" description="USB Maximum Receive Data Endpoint 3">
		<bitfield id="MAXLOAD" description="Maximum Payload" begin="10" end="0" width="11" rwaccess="RW"/>
	</register>
	<register id="USBRXCSRL3" width="8" page="1" offset="0x136" internal="0" description="USB Receive Control and Status Endpoint 3 Low">
		<bitfield id="RXRDY" description="Recieve Packet Ready" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FULL" description="FIFO Full" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OVERERROR3" description="Overrun/Error" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DATAERRNAKTO" description="Data Error/NAK Timeout" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="FLUSH" description="Flush FIFO" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="STALLREQPKT" description="Send Stall/Request Packet" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="STALLED" description="Endpoint Stalled" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CLRDT" description="Clear Data Toggle" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBRXCSRH3" width="8" page="1" offset="0x137" internal="0" description="USB Receive Control and Status Endpoint 3 High">
		<bitfield id="DT" description="Data Toggle" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DTWE" description="Data Toggle Write Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DMAMOD" description="DMA Request Mode" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DISNYETPIDERR" description="Disable NYET / PID Error" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="DMAEN" description="DMA Request Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ISOAUTORQ" description="Isochronous Transfers/Auto Request" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="AUTOCL" description="Auto Clear" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBRXCOUNT3" width="16" page="1" offset="0x138" internal="0" description="USB Receive Byte Count Endpoint 3">
		<bitfield id="COUNT" description="Receive Packet Count" begin="12" end="0" width="13" rwaccess="R"/>
	</register>
	<register id="USBTXTYPE3" width="8" page="1" offset="0x13a" internal="0" description="USB Host Transmit Configure Type Endpoint 3">
		<bitfield id="TEP" description="Target Endpoint Number" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="PROTO" description="Protocol" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SPEED" description="Operating Speed" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="USBTXINTERVAL3" width="8" page="1" offset="0x13b" internal="0" description="USB Host Transmit Interval Endpoint 3">
		<bitfield id="TXPOLLNAKLMT" description="TX Polling / NAK Limit" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="USBRXTYPE3" width="8" page="1" offset="0x13c" internal="0" description="USB Host Configure Receive Type Endpoint 3">
		<bitfield id="TEP" description="Target Endpoint Number" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="PROTO" description="Protocol" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SPEED" description="Operating Speed" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="USBRXINTERVAL3" width="8" page="1" offset="0x13d" internal="0" description="USB Host Receive Polling Interval Endpoint 3">
		<bitfield id="RXPOLLNAKLMT" description="RX Polling / NAK Limit" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="USBRQPKTCOUNT1" width="16" page="1" offset="0x304" internal="0" description="USB Request Packet Count in Block Transfer Endpoint 1">
		<bitfield id="COUNT" description="FIFO Count" begin="12" end="0" width="13" rwaccess="RW"/>
	</register>
	<register id="USBRQPKTCOUNT2" width="16" page="1" offset="0x308" internal="0" description="USB Request Packet Count in Block Transfer Endpoint 2">
		<bitfield id="COUNT" description="FIFO Count" begin="12" end="0" width="13" rwaccess="RW"/>
	</register>
	<register id="USBRQPKTCOUNT3" width="16" page="1" offset="0x30c" internal="0" description="USB Request Packet Count in Block Transfer Endpoint 3">
		<bitfield id="COUNT" description="FIFO Count" begin="12" end="0" width="13" rwaccess="RW"/>
	</register>
	<register id="USBRXDPKTBUFDIS" width="16" page="1" offset="0x340" internal="0" description="USB Receive Double Packet Buffer Disable">
		<bitfield id="EP1" description="EP1 RX Double Packet Buffer Disable" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EP2" description="EP2 RX Double Packet Buffer Disable" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EP3" description="EP3 RX Double Packet Buffer Disable" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="USBTXDPKTBUFDIS" width="16" page="1" offset="0x342" internal="0" description="USB Transmit Double Packet Buffer Disable">
		<bitfield id="EP1" description="EP1 TX Double Packet Buffer Disable" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EP2" description="EP2 TX Double Packet Buffer Disable" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EP3" description="EP3 TX Double Packet Buffer Disable" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="USBEPC" width="32" page="1" offset="0x400" internal="0" description="USB External Power Control">
		<bitfield id="EPEN" description="External Power Supply Enable Configuration" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="EPENDE" description="EPEN Drive Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PFLTEN" description="Power Fault Input Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PFLTSEN" description="Power Fault Sense" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PFLTAEN" description="Power Fault Action Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PFLTACT" description="Power Fault Action" begin="9" end="8" width="2" rwaccess="RW"/>
	</register>
	<register id="USBEPCRIS" width="32" page="1" offset="0x404" internal="0" description="USB External Power Control Raw Interrupt Status">
		<bitfield id="PF" description="Power Fault Interrupt Status" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="USBEPCIM" width="32" page="1" offset="0x408" internal="0" description="USB External Power Control Interrupt Mask">
		<bitfield id="PF" description="Power Fault Interrupt Mask" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="USBEPCISC" width="32" page="1" offset="0x40c" internal="0" description="USB External Power Control Interrupt Status and Clear">
		<bitfield id="PF" description="Power Fault Interrupt Status and Clear" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="USBDRRIS" width="32" page="1" offset="0x410" internal="0" description="USB Device RESUME Raw Interrupt Status">
		<bitfield id="RESUME" description="Resume Interrupt Status" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
