IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_usb_regs.xml
	<register id="USBDRIM" width="32" page="1" offset="0x414" internal="0" description="USB Device RESUME Interrupt Mask">
		<bitfield id="RESUME" description="Resume Interrupt Mask" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="USBDRISC" width="32" page="1" offset="0x418" internal="0" description="USB Device RESUME Interrupt Status and Clear">
		<bitfield id="RESUME" description="Resume Interrupt Status and Clear" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="USBGPCS" width="32" page="1" offset="0x41c" internal="0" description="USB General-Purpose Control and Status">
		<bitfield id="DEVMOD" description="Device Mode" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DEVMODOTG" description="Enable Device Mode" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="USBVDC" width="32" page="1" offset="0x430" internal="0" description="USB VBUS Droop Control">
		<bitfield id="VBDEN" description="Vbus Droop Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="USBVDCRIS" width="32" page="1" offset="0x434" internal="0" description="USB VBUS Droop Control Raw Interrupt Status">
		<bitfield id="VD" description="Vbus Droop Raw Interrupt Status" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="USBVDCIM" width="32" page="1" offset="0x438" internal="0" description="USB VBUS Droop Control Interrupt Mask">
		<bitfield id="VD" description="Vbus Droop Interrupt Mask" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="USBVDCISC" width="32" page="1" offset="0x43c" internal="0" description="USB VBUS Droop Control Interrupt Status and Clear">
		<bitfield id="VD" description="Vbus Droop Interrupt Status and Clear" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="USBIDVRIS" width="32" page="1" offset="0x444" internal="0" description="USB ID Valid Detect Raw Interrupt Status">
		<bitfield id="ID" description="ID Valid Detect Raw Interrupt Status" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="USBIDVIM" width="32" page="1" offset="0x448" internal="0" description="USB ID Valid Detect Interrupt Mask">
		<bitfield id="ID" description="ID Valid Detect Interrupt mask" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="USBIDVISC" width="32" page="1" offset="0x44c" internal="0" description="USB ID Valid Detect Interrupt Status and Clear">
		<bitfield id="ID" description="ID Valid Detect Interrupt Status and Clear" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="USBDMASEL" width="32" page="1" offset="0x450" internal="0" description="USB DMA Select">
		<bitfield id="DMAARX" description="DMA A RX Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="DMAATX" description="DMA A TX Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="DMABRX" description="DMA B RX Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="DMABTX" description="DMA B TX Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="DMACRX" description="DMA C RX Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="DMACTX" description="DMA C TX Select" begin="23" end="20" width="4" rwaccess="RW"/>
	</register>
	<register id="USB_GLB_INT_EN" width="32" page="1" offset="0x480" internal="0" description="USB Global Interrupt Enable Register[[br]]Note: This Register is applicable only when USB is mapped to CPU1">
		<bitfield id="INTEN" description="Global Interrupt Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="USB_GLB_INT_FLG" width="32" page="1" offset="0x484" internal="0" description="USB Global Interrupt Flag Register[[br]]Note: This Register is applicable only when USB is mapped to CPU1">
		<bitfield id="INTFLG" description="Global Interrupt Flag" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="USB_GLB_INT_FLG_CLR" width="32" page="1" offset="0x488" internal="0" description="USB Global Interrupt Flag Clear Register[[br]]Note: This Register is applicable only when USB is mapped to CPU1">
		<bitfield id="INTFLG" description="Global Interrupt Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="USBDMARIS" width="32" page="1" offset="0x500" internal="0" description="USB uDMA Raw Interrupt Status register.[[br]]Note: This Register is applicable only when USB is mapped to CM">
		<bitfield id="USB_DMAA_Rx_DONE" description="DMA Rx done interrupt for DMAA" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="USB_DMAA_TX_DONE" description="DMA Tx done interrupt for DMAA" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="USB_DMAB_RX_DONE" description="DMA Rx done interrupt for DMAB" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="USB_DMAB_TX_DONE" description="DMA Tx done interrupt for DMAB" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="USB_DMAC_RX_DONE" description="DMA Rx done interrupt for DMAC" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="USB_DMAC_TX_DONE" description="DMA Tx done interrupt for DMAC" begin="5" end="5" width="1" rwaccess="R"/>
	</register>
	<register id="USBDMAIM" width="32" page="1" offset="0x504" internal="0" description="USB uDMA Interrupt Mask Register[[br]]Note: This Register is applicable only when USB is mapped to CM">
		<bitfield id="USB_DMAA_Rx_DONE" description="DMA Rx done interrupt mask for DMAA" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="USB_DMAA_TX_DONE" description="DMA Tx done interrupt mask for DMAA" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="USB_DMAB_RX_DONE" description="DMA Rx done interrupt mask for DMAB" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="USB_DMAB_TX_DONE" description="DMA Tx done interrupt mask for DMAB" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="USB_DMAC_RX_DONE" description="DMA Rx done interrupt mask for DMAC" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="USB_DMAC_TX_DONE" description="DMA Tx done interrupt mask for DMAC" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="USBDMAISC" width="32" page="1" offset="0x508" internal="0" description="USB uDMA Interrupt Status and Clear Register[[br]]Note: This Register is applicable only when USB is mapped to CM">
		<bitfield id="USB_DMAA_Rx_DONE" description="DMA Rx done interrupt mask for DMAA" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="USB_DMAA_TX_DONE" description="DMA Tx done interrupt mask for DMAA" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="USB_DMAB_RX_DONE" description="DMA Rx done interrupt mask for DMAB" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="USB_DMAB_TX_DONE" description="DMA Tx done interrupt mask for DMAB" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="USB_DMAC_RX_DONE" description="DMA Rx done interrupt mask for DMAC" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="USB_DMAC_TX_DONE" description="DMA Tx done interrupt mask for DMAC" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
</module>
